# ●システム効果音定義ファイル
#
# 定義方法：
#   タグ				効果音なし
#   タグ = ファイル			効果音ファイル指定
#   タグ = ファイル : チャンネル(～9)	チャンネルつき効果音指定
#   タグ = @タグ			エイリアス
# 
# 先頭が「#」はコメントです。行頭と行末の空白は無視されます。
# タグは大文字小文字を区別しません。
#
# タグについて：
# 「.」で区切られた階層構造概念があり，
# 「*」を指定するとその階層以下のデフォルトの指定となります。
#
#    *           = 全てのデフォルト
#    menu.*      = ウィンドウメニュー以下のデフォルト
#    menu.file.* = ファイルメニュー以下のデフォルト
#
# エイリアスについて：
#    @ タグ，で別のタグの設定をコピーします。
#    エイリアス同士がリング状でつながると無限ループになるので注意。
#
#
# uipsd.funcでの 効果音設定例
# eval,names,call,uiloadSysSE,セクション名

# 汎用効果音定義
#
ok     = sysse_ok
cancel = sysse_cancel
select = sysse_cur1 : 8
page   = sysse_cur2 : 8
popup  = sysse_cur2 : 7

# 汎用ルール
*.enter       = @select
*.click       = @ok
*.nose.enter  
*.nose.click  
*.close.click 
*.back.click  
*.open        = @ok
*.back        = @cancel
*.close       = @cancel

*.page.click  = @page

# メニュー周り
# （ショートカットキーやメッセージ窓上のボタンを兼ねる）
menu.save    = @ok
menu.load    = @ok
menu.qload   = @ok
menu.auto    = @ok
menu.skip    = @ok
menu.option  = @ok
#menu.rclick  = @cancel
menu.qsave   = @ok
#menu.title
#menu.exit
#menu.next
#menu.prev
#menu.backlog 
#menu.window
#menu.fullscreen
#menu.togglescreen
menu.scnsel   = @ok


# タイトル画面
title.exit.click

# メッセージ窓上ボタン
window.*.enter
window.*.click
window.auto.click = @ok
window.skip.click = @ok
window.hide.click = @cancel

window.flow.click = @ok
window.return.click = @ok

# バックログ
history.open  = @ok
history.close = @cancel

# セーブ・ロード
#saveload.*

# 選択肢
#select.*
select.open = @page

# 確認ダイアログ
dialog.yes.click  = @ok
dialog.no.click   = @cancel
dialog.ok.click   = @cancel

# 設定画面
option.title.click
option.close.click  = @cancel
option.voice.click
option.samplese.click = @sample.se

# エクストラ系
cgmode.next = @ok
cgmode.cancel = @cancel

soundmode.item.enter
soundmode.item.click
soundmode.ctrl.enter
soundmode.ctrl.click
soundmode.volume.enter

#svmode.rclick = @cancel
#svmode.hide.click
svmode.panel.click

exchview.view.done = @cancel


# フローチャート画面

flow.back
flow.select = @ok

# 更新される
flow.update
flow.fragment = @ok



# サンプルボイス

sample.se          = config_sample1
sample.voice       = 

sample.ユキ        = b01_00085
sample.アル        = b02_00092
sample.真央        = b03_00066
sample.心音        = b04_00061
sample.一真        = b05_00048
sample.真菜美      = b06_00037
sample.優子        = b07_00044
sample.鈴          = b08_00038

sample.クシミ      = a01_00065
sample.莉都        = c01_00373
sample.星華        = c02_00076
sample.和奏        = c03_00222
sample.白雪        = c04_00167
sample.小夜璃      = c05_00027
sample.陽太        = c07_00028
sample.慶一        = c08_00007
sample.小太郎      = c09_00009
sample.クラウス    = c10_00031
sample.麻里香      = c11_00089
sample.媛子        = c12_00001
sample.深弥        = c13_00034
sample.朱美        = c14_00010

sample.春奈        = a02_00026
sample.さくや      = d01_00150
sample.翔子        = d02_00068
sample.いろは      = d03_00040
sample.銀子        = d04_00060
sample.皐月        = d05_00076
sample.沙智子      = d06_00027
sample.朱音        = d07_00075
sample.美里        = d08_00063

#sample.礼次       = b09_00001
#sample.タマ       = c06_00001

sample.その他男    = e01_00001
sample.その他女    = e02_00001
